Influencer Model:
Model: "sequential_8"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_32 (Dense)            (None, 512)               12800     
                                                                 
 dropout_16 (Dropout)        (None, 512)               0         
                                                                 
 dense_33 (Dense)            (None, 512)               262656    
                                                                 
 dropout_17 (Dropout)        (None, 512)               0         
                                                                 
 dense_34 (Dense)            (None, 256)               131328    
                                                                 
 dropout_18 (Dropout)        (None, 256)               0         
                                                                 
 dense_35 (Dense)            (None, 256)               65792     
                                                                 
 dense_36 (Dense)            (None, 128)               32896     
                                                                 
=================================================================
Total params: 505,472
Trainable params: 505,472
Non-trainable params: 0
_________________________________________________________________

Owner Model:
Model: "sequential_9"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_37 (Dense)            (None, 512)               12288     
                                                                 
 dropout_19 (Dropout)        (None, 512)               0         
                                                                 
 dense_38 (Dense)            (None, 512)               262656    
                                                                 
 dropout_20 (Dropout)        (None, 512)               0         
                                                                 
 dense_39 (Dense)            (None, 256)               131328    
                                                                 
 dropout_21 (Dropout)        (None, 256)               0         
                                                                 
 dense_40 (Dense)            (None, 256)               65792     
                                                                 
 dropout_22 (Dropout)        (None, 256)               0         
                                                                 
 dense_41 (Dense)            (None, 128)               32896     
                                                                 
=================================================================
Total params: 504,960
Trainable params: 504,960
Non-trainable params: 0
_________________________________________________________________

Full Model:
Model: "model_4"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 inf_feature (InputLayer)       [(None, 24)]         0           []                               
                                                                                                  
 own_feature (InputLayer)       [(None, 23)]         0           []                               
                                                                                                  
 sequential_8 (Sequential)      (None, 128)          505472      ['inf_feature[0][0]']            
                                                                                                  
 sequential_9 (Sequential)      (None, 128)          504960      ['own_feature[0][0]']            
                                                                                                  
 tf.math.l2_normalize_8 (TFOpLa  (None, 128)         0           ['sequential_8[0][0]']           
 mbda)                                                                                            
                                                                                                  
 tf.math.l2_normalize_9 (TFOpLa  (None, 128)         0           ['sequential_9[0][0]']           
 mbda)                                                                                            
                                                                                                  
 dot_4 (Dot)                    (None, 1)            0           ['tf.math.l2_normalize_8[0][0]', 
                                                                  'tf.math.l2_normalize_9[0][0]'] 
                                                                                                  
==================================================================================================
Total params: 1,010,432
Trainable params: 1,010,432
Non-trainable params: 0
__________________________________________________________________________________________________
