Influencer Model:
Model: "sequential_4"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_16 (Dense)            (None, 512)               12288     
                                                                 
 dropout_2 (Dropout)         (None, 512)               0         
                                                                 
 dense_17 (Dense)            (None, 128)               65664     
                                                                 
 dropout_3 (Dropout)         (None, 128)               0         
                                                                 
 dense_18 (Dense)            (None, 64)                8256      
                                                                 
 dense_19 (Dense)            (None, 64)                4160      
                                                                 
=================================================================
Total params: 90,368
Trainable params: 90,368
Non-trainable params: 0
_________________________________________________________________

Owner Model:
Model: "sequential_5"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_20 (Dense)            (None, 512)               11776     
                                                                 
 dropout_4 (Dropout)         (None, 512)               0         
                                                                 
 dense_21 (Dense)            (None, 256)               131328    
                                                                 
 dropout_5 (Dropout)         (None, 256)               0         
                                                                 
 dense_22 (Dense)            (None, 128)               32896     
                                                                 
 dense_23 (Dense)            (None, 64)                8256      
                                                                 
=================================================================
Total params: 184,256
Trainable params: 184,256
Non-trainable params: 0
_________________________________________________________________

Full Model:
Model: "model_2"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 inf_feature (InputLayer)       [(None, 23)]         0           []                               
                                                                                                  
 own_feature (InputLayer)       [(None, 22)]         0           []                               
                                                                                                  
 sequential_4 (Sequential)      (None, 64)           90368       ['inf_feature[0][0]']            
                                                                                                  
 sequential_5 (Sequential)      (None, 64)           184256      ['own_feature[0][0]']            
                                                                                                  
 tf.math.l2_normalize_4 (TFOpLa  (None, 64)          0           ['sequential_4[0][0]']           
 mbda)                                                                                            
                                                                                                  
 tf.math.l2_normalize_5 (TFOpLa  (None, 64)          0           ['sequential_5[0][0]']           
 mbda)                                                                                            
                                                                                                  
 dot_2 (Dot)                    (None, 1)            0           ['tf.math.l2_normalize_4[0][0]', 
                                                                  'tf.math.l2_normalize_5[0][0]'] 
                                                                                                  
==================================================================================================
Total params: 274,624
Trainable params: 274,624
Non-trainable params: 0
__________________________________________________________________________________________________
