Influencer Model:
Model: "sequential_10"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_42 (Dense)            (None, 256)               6400      
                                                                 
 dense_43 (Dense)            (None, 32)                8224      
                                                                 
=================================================================
Total params: 14,624
Trainable params: 14,624
Non-trainable params: 0
_________________________________________________________________

Owner Model:
Model: "sequential_11"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_44 (Dense)            (None, 256)               6144      
                                                                 
 dropout_23 (Dropout)        (None, 256)               0         
                                                                 
 dense_45 (Dense)            (None, 32)                8224      
                                                                 
=================================================================
Total params: 14,368
Trainable params: 14,368
Non-trainable params: 0
_________________________________________________________________

Full Model:
Model: "model_5"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 inf_feature (InputLayer)       [(None, 24)]         0           []                               
                                                                                                  
 own_feature (InputLayer)       [(None, 23)]         0           []                               
                                                                                                  
 sequential_10 (Sequential)     (None, 32)           14624       ['inf_feature[0][0]']            
                                                                                                  
 sequential_11 (Sequential)     (None, 32)           14368       ['own_feature[0][0]']            
                                                                                                  
 tf.math.l2_normalize_10 (TFOpL  (None, 32)          0           ['sequential_10[0][0]']          
 ambda)                                                                                           
                                                                                                  
 tf.math.l2_normalize_11 (TFOpL  (None, 32)          0           ['sequential_11[0][0]']          
 ambda)                                                                                           
                                                                                                  
 dot_5 (Dot)                    (None, 1)            0           ['tf.math.l2_normalize_10[0][0]',
                                                                  'tf.math.l2_normalize_11[0][0]']
                                                                                                  
==================================================================================================
Total params: 28,992
Trainable params: 28,992
Non-trainable params: 0
__________________________________________________________________________________________________
