Influencer Model:
Model: "sequential_4"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_8 (Dense)             (None, 256)               6656      
                                                                 
 dropout_4 (Dropout)         (None, 256)               0         
                                                                 
 dense_9 (Dense)             (None, 64)                16448     
                                                                 
=================================================================
Total params: 23,104
Trainable params: 23,104
Non-trainable params: 0
_________________________________________________________________

Owner Model:
Model: "sequential_5"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_10 (Dense)            (None, 256)               6400      
                                                                 
 dropout_5 (Dropout)         (None, 256)               0         
                                                                 
 dense_11 (Dense)            (None, 64)                16448     
                                                                 
=================================================================
Total params: 22,848
Trainable params: 22,848
Non-trainable params: 0
_________________________________________________________________

Full Model:
Model: "model_2"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 inf_feature (InputLayer)       [(None, 25)]         0           []                               
                                                                                                  
 own_feature (InputLayer)       [(None, 24)]         0           []                               
                                                                                                  
 sequential_4 (Sequential)      (None, 64)           23104       ['inf_feature[0][0]']            
                                                                                                  
 sequential_5 (Sequential)      (None, 64)           22848       ['own_feature[0][0]']            
                                                                                                  
 tf.math.l2_normalize_6 (TFOpLa  (None, 64)          0           ['sequential_4[0][0]']           
 mbda)                                                                                            
                                                                                                  
 tf.math.l2_normalize_7 (TFOpLa  (None, 64)          0           ['sequential_5[0][0]']           
 mbda)                                                                                            
                                                                                                  
 dot_2 (Dot)                    (None, 1)            0           ['tf.math.l2_normalize_6[0][0]', 
                                                                  'tf.math.l2_normalize_7[0][0]'] 
                                                                                                  
==================================================================================================
Total params: 45,952
Trainable params: 45,952
Non-trainable params: 0
__________________________________________________________________________________________________
